Revit 2027 API
FabricationPart.GetOptionDefinitions Method
 Gets a copy of current fabrication option definitions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<FabricationOptionDefinition> GetOptionDefinitions()
Public Function GetOptionDefinitions As IList(Of FabricationOptionDefinition)
public:
IList<FabricationOptionDefinition^>^ GetOptionDefinitions()
member GetOptionDefinitions : unit -> IList<FabricationOptionDefinition>
Return Value
IList<FabricationOptionDefinition>
 Returns an array of fabrication options.
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace